package com.xm.ssit.demo.util.qlexpress;

import com.jayway.jsonpath.JsonPath;
import com.jayway.jsonpath.ReadContext;

/**
 * @Auther: yechengzong
 * @Date: 2019/1/11 15:19
 * @Description:
 */
public class QLExpressFunctions {
	/**
	 * @param jsonString
	 * @param jsonPathExpress $ 表示根元素
	 * @return
	 * @ 当前元素
	 * . or []	子元素
	 * ..	递归下降，JSONPath是从E4X借鉴的。
	 * 通配符，表示所有的元素
	 * []	子元素操作符
	 * [,]	连接操作符在XPath 结果合并其它结点集合。JSONP允许name或者数组索引。
	 * [start:end:step]	数组分割操作从ES4借鉴。
	 * ?()	应用过滤表示式
	 * ()	脚本表达式，使用在脚本引擎下面。
	 */

	public static Object getValueFromJSONByPath(String jsonString, String jsonPathExpress) {
		ReadContext context = JsonPath.parse(jsonString);
		return context.read(jsonPathExpress);
	}


	public static void main(String[] args) {
		String jsonString = "{\"消金\":{\"代偿分期\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"手机号次数\":\"3\",\"一般消费分期平台\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"现金类分期\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"身份证次数\":\"0\",\"大型消费金融公司\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"}},\"银行\":{\"手机号次数\":\"0\",\"银行消费金融公司\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"银行个人业务\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"直销银行\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"信用卡中心\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"网上银行\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"银行对公业务\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"身份证次数\":\"0\",\"银行小微贷款\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"}},\"手机号次数合计\":\"0\",\"身份证次数合计\":\"0\",\"p2p与小贷\":{\"手机号次数\":\"0\",\"小额贷款\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"身份证次数\":\"0\",\"P2P网贷\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"}},\"其他\":{\"房地产金融\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"手机号次数\":\"0\",\"互联网金融门户\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"融资租赁\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"财产保险\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"第三方服务商\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"身份证次数\":\"0\",\"资产转让\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"大数据金融\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"担保\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"信保\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"人生保险\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"},\"厂商汽车金融\":{\"手机号次数\":\"0\",\"身份证次数\":\"0\"}}}";
		String keypath = "$.消金.手机号次数";
		System.out.println(getValueFromJSONByPath(jsonString, keypath));

	}

}
